IDEA Open Model
DirectionType Enumeration
Compatible with IDEA StatiCa 20.1
 Direction type
 Namespace: IdeaRS.OpenModel.Detail.Loading
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum DirectionType
Public Enumeration DirectionType
Members
Member name | Value | Description
GlobalX | 0 |  GlobalX
GlobalY | 1 |  Global Y
GlobalZ | 2 |  Global Z
LocalX | 3 |  Local X
LocalY | 4 |  Local Y
LocalZ | 5 |  Local Z
See Also
Reference
IdeaRS.OpenModel.Detail.Loading Namespace